Here's a very simple example of whats happening here.

```terraform
resource "azurerm_resource_group" "example" {
  name     = "example"
  location = "West Europe"
}

data "azurerm_resource_group" "example" {
  name = "example"
}
```

So here you can see that it knows it needs to create a resource group, but I can't do a data look up on said resource because it doesn't exist yet.
```shell
tf-test $ tf plan
data.azurerm_resource_group.example: Reading...

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # azurerm_resource_group.example will be created
  + resource "azurerm_resource_group" "example" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "example"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Error: Error: Resource Group "example" was not found
│ 
│   with data.azurerm_resource_group.example,
│   on main.tf line 6, in data "azurerm_resource_group" "example":
│    6: data "azurerm_resource_group" "example" {
│ 
╵
```

Now, I can get around this by setting a dependency on it:
```terraform
resource "azurerm_resource_group" "example" {
  name     = "example"
  location = "West Europe"
}

data "azurerm_resource_group" "example" {
  name = "example"
  depends_on = [ azurerm_resource_group.example ]
}
```

Which works nicely:
```shell
tf-test $ tf plan

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_resource_group.example will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "example" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "example"
      + tags       = (known after apply)
    }

  # azurerm_resource_group.example will be created
  + resource "azurerm_resource_group" "example" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "example"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

However, because the data look up is in the module, I can't force this. I have tried to put the dependancy on the module itself when declared but this still didn't work.